tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "warrensbox/tap"
tap "norwoodj/tap"
tap "caarlos0/tap"
tap "instrumenta/instrumenta"

# Development & Power Tools
brew "bash"
brew "bash-completion"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "wget"
brew "coreutils"
brew 'diff-so-fancy'
brew "fzf"
brew "gawk"
brew "jq"
brew "watch"
brew "telnet"
brew "tree"
brew "go"
brew "python3"
brew "node"
brew "yarn"
brew "gradle"
brew "maven"
brew "gh"
brew "bfg"
brew "serverless"
brew "terraform"
brew "warrensbox/tap/tfswitch"
brew "awscli"
cask "google-cloud-sdk"
brew "mongodb/brew/mongodb-community"
brew "postgresql"
brew "redis"
brew "firebase-cli"
brew "lsd"
brew "pass"
brew "imagemagick"
brew "git-xargs"
brew "nmap"
brew "org-stats"

# Commit signing
brew 'pinentry-mac'
brew 'gnupg'
cask 'keybase'

# Containers
brew "kubernetes-cli"
brew "kubectx"
brew "kube-ps1"
brew "kustomize"
brew "kubeval"
brew "helm"
brew "norwoodj/tap/helm-docs"
brew "minikube"
brew "kind"
cask "docker"

# VMs
brew "lima"
cask "virtualbox"
cask "vagrant"
cask "vagrant-manager"

# Development
cask "visual-studio-code"
# cask "open-in-code"
cask "insomnia"
cask "leapp"

# Tools
cask "authy"
cask "middleclick"
cask "tunnelblick"
# cask "recordit"

# Desktop Software
cask "iterm2"
cask "zoom"
cask "slack"
cask "spotify"
cask "google-chrome"
cask "firefox"
cask "telegram"
cask "discord"
cask "notion"
cask "drawio"
cask "raycast"
cask "sonic-pi"
# cask "microsoft-office"
# cask "microsoft-auto-update"
# cask "steam"
