tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "warrensbox/tap"

# Development & Power Tools
brew "bash"
brew "bash-completion"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "wget"
brew "coreutils"
brew "fzf"
brew "gawk"
brew "jq"
brew "watch"
brew "telnet"
brew "unrar"
brew "tree"
brew "go"
brew "python2"
brew "python3"
brew "node"
brew "nvm"
brew "yarn"
brew "gradle"
brew "maven"
brew "gh"
brew "serverless"
brew "terraform"
brew "warrensbox/tap/tfswitch"
brew "awscli"
cask "google-cloud-sdk"
brew "mongodb/brew/mongodb-community"
brew "postgresql"
brew "redis"

# Commit signing
brew 'pinentry-mac'
brew 'gnupg'
cask 'keybase'

# Containers
brew "kubernetes-cli"
brew "kubectx"
brew "kube-ps1"
brew "kustomize"
brew "helm"
cask "minikube"
cask "docker"

# Desktop Software
cask "visual-studio-code"
cask "zoomus"
cask "slack"
cask "spotify"
cask "google-chrome"
cask "authy"
cask "clipy"
cask "insomnia"
cask "iterm2"
cask "middleclick"
cask "tunnelblick"
cask "rectangle"
cask "open-in-code"
cask "telegram"
cask "notion"
cask "drawio"
# cask "microsoft-office"
# cask "microsoft-auto-update"
# cask "steam"
# cask "virtualbox"
# cask "firefox"
# cask "recordit"
